   const par = document.getElementsByName("p")

 //   elem.childNodes[0] === elem.firstChild
   // elem.childNodes[elem.childNodes.length - 1] === elem.lastChild

console.log("p");
console.log("title")

//alert(); // "text"
console.log(); // "elem"
   //2.2. Получить html-элемент из дом дерева по его id и вывести в консоль (getElementById)
    //2.3. Получить все элементы списка из дом дерева и вывести в консоль. (querySelectorAll)
    //2.4. Получить первый элемент списка (querySelector)
    //2.5. Получить родителя первого элемента списка (closest)
    
    //3. Добавить во все элементы списка произвольный текст
    
    //4.
    //4.1. Создать пустой html-узел для абзаца и добавить в него любой текст.
    //4.2. Добавить созданный абзац последним элементом в body
    
    //5. 
    //5.1. Для созданного ранее абзаца, добавить два любых класса
    //5.2. Удалить класс у, созданного ранее, списка элементов
    
    //6. С помощью js изменить цвет текста для всех элементов списка и цвет заливка для абзаца.
    //DOM-дерево-->